# Пользователь водит свое имя.
# Возвращается тектс в БОЛЬШОМ и маленьком регистре. Использовать ' '.format().
# Для вставки аргументов в текст.
# Входные данные: Apollo
# Результат: APPOLLO apollo

input_string = "Apollo"
upper_string = input_string.upper()
lower_string = input_string.lower()
print("{} {}".format(upper_string, lower_string))
